In [1]:
import numpy as np
import pandas as pd

In [2]:
columns = ['W', 'X', 'Y', 'Z']

In [3]:
index = ['A', 'B', 'C', 'D', 'E']

In [4]:
from numpy.random import randint

In [7]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [8]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [9]:
df = pd.DataFrame(data,index,columns)

In [10]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [11]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [14]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [16]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [21]:
df['B'] = df['W'] +df['Y']

In [22]:
df

    W   X   Y   Z  new    B
A   2  79  -6 -86   -6   -4
B   6 -29  94 -80   94  100
C   2  21 -24 -13  -24  -22
D  16  -1  19  51   19   35
E  30  49 -18 -99  -18   12

In [24]:
df.drop('new',axis=1)

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [25]:
df

    W   X   Y   Z  new    B
A   2  79  -6 -86   -6   -4
B   6 -29  94 -80   94  100
C   2  21 -24 -13  -24  -22
D  16  -1  19  51   19   35
E  30  49 -18 -99  -18   12

In [26]:
df = df.drop('new',axis=1)

In [27]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [28]:
df.loc['A']

W     2
X    79
Y    -6
Z   -86
B    -4
Name: A, dtype: int32

In [29]:
df.loc[['A','E']]

    W   X   Y   Z   B
A   2  79  -6 -86  -4
E  30  49 -18 -99  12

In [30]:
df.iloc[0]

W     2
X    79
Y    -6
Z   -86
B    -4
Name: A, dtype: int32

In [31]:
df.drop('C')

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [32]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [33]:
df.loc['A', 'W']

2

In [34]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -6
C  2 -24

In [35]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [36]:
df > 0

      W      X      Y      Z      B
A  True   True  False  False  False
B  True  False   True  False   True
C  True   True  False  False  False
D  True  False   True   True   True
E  True   True  False  False   True

In [37]:
df[df > 0]

    W     X     Y     Z      B
A   2  79.0   NaN   NaN    NaN
B   6   NaN  94.0   NaN  100.0
C   2  21.0   NaN   NaN    NaN
D  16   NaN  19.0  51.0   35.0
E  30  49.0   NaN   NaN   12.0

In [38]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [39]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [40]:
df[df['X']>0]

    W   X   Y   Z   B
A   2  79  -6 -86  -4
C   2  21 -24 -13 -22
E  30  49 -18 -99  12

In [41]:
df[df['X']>0]['W']

A     2
C     2
E    30
Name: W, dtype: int32

In [42]:
df[df['X']>0].iloc

In [44]:
df[(df['W']>0) & (df['Y'] > 1)]

    W   X   Y   Z    B
B   6 -29  94 -80  100
D  16  -1  19  51   35

In [45]:
df[(df['W']>0) | (df['Y'] > 1)]

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [46]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [47]:
df.reset_index()

  index   W   X   Y   Z    B
0     A   2  79  -6 -86   -4
1     B   6 -29  94 -80  100
2     C   2  21 -24 -13  -22
3     D  16  -1  19  51   35
4     E  30  49 -18 -99   12

In [48]:
df

    W   X   Y   Z    B
A   2  79  -6 -86   -4
B   6 -29  94 -80  100
C   2  21 -24 -13  -22
D  16  -1  19  51   35
E  30  49 -18 -99   12

In [55]:
new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [56]:
df['States'] = new_ind

In [57]:
DF

NameError: name 'DF' is not defined

In [58]:
df

    W   X   Y   Z    B States
A   2  79  -6 -86   -4     CA
B   6 -29  94 -80  100     NY
C   2  21 -24 -13  -22     WY
D  16  -1  19  51   35     OR
E  30  49 -18 -99   12     CO

In [61]:
df = df.set_index('States')

In [62]:
df

         W   X   Y   Z    B
States
CA       2  79  -6 -86   -4
NY       6 -29  94 -80  100
WY       2  21 -24 -13  -22
OR      16  -1  19  51   35
CO      30  49 -18 -99   12

In [63]:
df.columns

Index(['W', 'X', 'Y', 'Z', 'B'], dtype='object')

In [64]:
df #.columns

         W   X   Y   Z    B
States
CA       2  79  -6 -86   -4
NY       6 -29  94 -80  100
WY       2  21 -24 -13  -22
OR      16  -1  19  51   35
CO      30  49 -18 -99   12

In [65]:
df.describe()

              W          X          Y          Z           B
count   5.00000   5.000000   5.000000   5.000000    5.000000
mean   11.20000  23.800000  13.000000 -45.400000   24.200000
std    11.96662  42.109381  48.187135  63.366395   47.277902
min     2.00000 -29.000000 -24.000000 -99.000000  -22.000000
25%     2.00000  -1.000000 -18.000000 -86.000000   -4.000000
50%     6.00000  21.000000  -6.000000 -80.000000   12.000000
75%    16.00000  49.000000  19.000000 -13.000000   35.000000
max    30.00000  79.000000  94.000000  51.000000  100.000000

In [66]:
df.info

<bound method DataFrame.info of          W   X   Y   Z    B
States
CA       2  79  -6 -86   -4
NY       6 -29  94 -80  100
WY       2  21 -24 -13  -22
OR      16  -1  19  51   35
CO      30  49 -18 -99   12>

In [67]:
df.dtypes

W    int32
X    int32
Y    int32
Z    int32
B    int32
dtype: object